#+TITLE: Econometría Aplicada. Lección 1
#+author: Marcos Bujosa
#+LANGUAGE: es

# +OPTIONS: toc:nil

#+TAGS: noexport pdfs
#+EXCLUDE_TAGS: noexport

#+startup: shrink

# ###########
# ESTO DA EL FORMATO FINAL DE LA PÁGINA WEB VÉASE [[https://olmon.gitlab.io/org-themes/]]
#+SETUPFILE: ../css/readtheorg_inline.theme
# ###########

#+LATEX_HEADER_EXTRA: \usepackage{fullpage}


#+LATEX_HEADER_EXTRA: \usepackage[spanish]{babel}
#+LATEX_HEADER_EXTRA: \usepackage{lmodern}
#+LATEX_HEADER_EXTRA: \usepackage{tabularx}
#+LATEX_HEADER_EXTRA: \usepackage{booktabs}

#+LATEX: \maketitle

#+BEGIN_SRC emacs-lisp :exports none :results silent
(use-package ox-ipynb
  :load-path (lambda () (expand-file-name "ox-ipynb" scimax-dir)))
(use-package htmlize)
#+END_SRC

#+begin_abstract
En esta lección veremos algunas transformaciones de los datos para /"hacerlos estacionarios"/; y daremos interpretación a los datos transformados.
#+end_abstract

- [[https://mbujosab.github.io/EconometriaAplicada-SRC/Lecc01.html][lección en html]]
- [[https://mybinder.org/v2/gh/mbujosab/EconometriaAplicada-SRC/HEAD?labpath=Lecc01.ipynb][lección en mybinder]]


* COMMENT Tabla con org mode                                       :noexport:
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . skip)))
   :END:
  

#+begin_export html
<style>
.reveal  td {font-size: 120%;}
</style>
#+end_export
#+ATTR_LATEX: :align |c|l|p{2.4cm}|l|p{2.3cm}|p{3.4cm}|l|
|   | $t$ |     $y_t$ | Incremento en tanto por uno | $\ln y_t$ | Primera dife@@latex:\-@@rencia de $\ln\boldsymbol{y}$ | Incremento en tanto por uno desde $t=1$ | $\ln y_t- \ln y_{1}$ |
|---+-----+-----------+-----------------------------+-----------+-------------------------------------------------------+-----------------------------------------+----------------------|
| # |   1 |      100. |                             |  4.605170 |                                                       |                                         |                      |
| # |   2 | 101.00000 |                        0.01 |  4.615120 |                                                0.0100 |                                  0.0100 |               0.0100 |
| # |   3 | 102.01000 |                        0.01 |  4.625071 |                                                0.0100 |                                  0.0201 |               0.0199 |
| # |   4 | 103.03010 |                        0.01 |  4.635021 |                                                0.0100 |                                  0.0303 |               0.0299 |
| # |   5 | 104.06040 |                        0.01 |  4.644971 |                                                0.0100 |                                  0.0406 |               0.0398 |
| # |   6 | 105.10100 |                        0.01 |  4.654922 |                                                0.0100 |                                  0.0510 |               0.0498 |
| # |   7 | 106.15201 |                        0.01 |  4.664872 |                                                0.0100 |                                  0.0615 |               0.0597 |
| # |   8 | 107.21353 |                        0.01 |  4.674823 |                                                0.0100 |                                  0.0721 |               0.0697 |
| # |   9 | 108.28567 |                        0.01 |  4.684773 |                                                0.0100 |                                  0.0829 |               0.0796 |
| # |  10 | 109.36853 |                        0.01 |  4.694723 |                                                0.0100 |                                  0.0937 |               0.0896 |
#+TBLFM: @2$2=1::@3$2..@>$2=(@-1$2)+1;
#+TBLFM: @2$3=100.00::@3$3..@>$3=(@-1$3)*1.01;%.5f
#+TBLFM: @4$4..@>$4=($3-@-1$3)/100;%.2f;f3
#+TBLFM: @2$5..@>$5=log($3);%.6f
#+TBLFM: @4$6..@>$6=$5-@-1$5;%.4f;f3
#+TBLFM: @4$7..@>$7=($3-@2$3)/100;%.4f;f3
#+TBLFM: @4$8..@>$8=$5-@2$5;%.4f;f3

#+latex: \newpage


